BusinessProcesses/ПереоценкаТоваровРозница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<BusinessProcess>
		<Properties>
			<Name>ПереоценкаТоваровРозница</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.УстановкаЦенНоменклатуры</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачиПользователя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершенПринудительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦенНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оптовый</Name>
					<Comment>(Общ) Оптовый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розничный</Name>
					<Comment>(Общ) Розничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НТТ</Name>
					<Comment>(Общ) Неавтоматизированная торговая точка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексСтрокиТаблицыЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСклада</Name>
					<Comment>(Общ) Вид склада: оптовый, розничный, неавтоматизированная торговая точка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетРозничныхЦенПоТорговойНаценке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияПоКОАТУУ</Name>
					<Comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторКОАТУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКАТОТТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяИнспекция</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеИнспекции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиБизнесПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБизнесПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТочекМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВыполненияДн</Name>
							<Comment>Период выполнения дней</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВыполненияЧас</Name>
							<Comment>Период выполнения часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОповещенияДн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОповещенияЧас</Name>
							<Comment>Период оповещения - часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Comment>Настройка вложенного бизнес процесса</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВыполненияМин</Name>
							<Comment>Период выполнения часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОповещенияМин</Name>
							<Comment>Период оповещения - часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИсполнителейЗадач</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BusinessProcesses/ПереоценкаТоваровРозница/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
//ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет принудительное завершение бизнес-процесса.
//
Процедура ВыполнитьЗавершениеБизнесПроцесса() Экспорт

	// Сначала завершим все вложенные бизнес-процессы.
	ЗапросБизнесПроцессы = Новый Запрос;
	ЗапросБизнесПроцессы.УстановитьПараметр("БизнесПроцесс", Ссылка);
	ЗапросБизнесПроцессы.Текст = 
	"ВЫБРАТЬ
	|	ПереоценкаТоваровАТТ.Ссылка КАК БизнесПроцесс
	|ИЗ
	|	БизнесПроцесс.ПереоценкаТоваровАТТ КАК ПереоценкаТоваровАТТ
	|ГДЕ
	|	  ПереоценкаТоваровАТТ.Стартован = ИСТИНА
	|	И ПереоценкаТоваровАТТ.Завершен  = ЛОЖЬ
	|	И ПереоценкаТоваровАТТ.ВедущаяЗадача.БизнесПроцесс = &БизнесПроцесс";

	ВыборкаБизнесПроцессы = ЗапросБизнесПроцессы.Выполнить().Выбрать();
	РазмерВыборки         = ВыборкаБизнесПроцессы.Количество();
	СчетчикВыборки        = 0;

	НачатьТранзакцию();

	Пока ВыборкаБизнесПроцессы.Следующий() Цикл
		#Если Клиент Тогда
		Состояние(НСтр("ru='Обработка: ';uk='Обробка: '") + СчетчикВыборки + НСтр("ru=' из ';uk=' з '") + РазмерВыборки);
		#КонецЕсли

		СчетчикВыборки = СчетчикВыборки + 1;
		Попытка
	
			БизнесПроцессОбъект = ВыборкаБизнесПроцессы.БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.ВыполнитьЗавершениеБизнесПроцесса(Ложь);

		Исключение

			ВызватьИсключение НСтр("ru='Ошибка при завершении бизнес-процесса:';uk='Помилка при завершенні бізнес-процесу:'") + Строка(ВыборкаБизнесПроцессы.БизнесПроцесс)
								+ Символы.ПС + НСтр("ru='По причине: ';uk='Через : '") + ОписаниеОшибки();
		КонецПопытки;

	КонецЦикла;

	// Пометим все задачи как выполненные.
	ЗапросЗадачи       = Новый Запрос;
	ЗапросЗадачи.УстановитьПараметр("БизнесПроцесс", Ссылка);
	ЗапросЗадачи.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК ЗадачаПользователя
	|ИЗ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ГДЕ
	|	Задачи.БизнесПроцесс = &БизнесПроцесс
	|	И Задачи.Выполнена = ЛОЖЬ";

	Выборка        = ЗапросЗадачи.Выполнить().Выбрать();
	РазмерВыборки  = Выборка.Количество();
	СчетчикВыборки = 0;

	Пока Выборка.Следующий() Цикл

		#Если Клиент Тогда
		Состояние(НСтр("ru='Обработка: ';uk='Обробка: '") + СчетчикВыборки + НСтр("ru=' из ';uk=' з '") + РазмерВыборки);
		#КонецЕсли

		СчетчикВыборки = СчетчикВыборки + 1;
		Попытка

			ЗадачаОбъект = Выборка.ЗадачаПользователя.ПолучитьОбъект();
			ЗадачаОбъект.Выполнена = Истина;
			ЗадачаОбъект.Записать();

		Исключение

			ВызватьИсключение НСтр("ru='Ошибка при выполнении задачи:';uk='Помилка при виконанні задачі:'") + Строка(Выборка.ЗадачаПользователя)
								+ Символы.ПС + НСтр("ru='По причине: ';uk='Через : '") + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	
	ДатаЗавершения        = ТекущаяДата();
	Завершен              = Истина;
	ЗавершенПринудительно = Истина;

	Попытка

		Записать();

	Исключение

		ВызватьИсключение НСтр("ru='Ошибка при записи бизнес-процесса:';uk='Помилка при запису бізнес-процесу:'") + Строка(Ссылка)
							+ Символы.ПС + НСтр("ru='По причине: ';uk='Через : '") + ОписаниеОшибки();
	КонецПопытки;

	ЗафиксироватьТранзакцию();

КонецПроцедуры // ВыполнитьЗавершениеБизнесПроцесса()

////////////////////////////////////////////////////////////////////////////////
//СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Процедура вызывается в точке вложенного бизнес-процесса перед выполнением задач.
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачиПользователя.
//  Отказ - булево, флаг отказа от выполнения задачи.
//
Процедура ПроверитьВозможностьВыполненияЗадач(Задача, Отказ)

	//Проверим, что вложенные бизнес-процессы по задаче завершены.
	Заголовок = НСтр("ru='Выполнение задачи:';uk='Виконання задачі:'") + Задача;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВедущаяЗадача", Задача);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПереоценкаТоваровАТТ.Ссылка) КАК БизнесПроцессПредставление
	|ИЗ
	|	БизнесПроцесс.ПереоценкаТоваровАТТ КАК ПереоценкаТоваровАТТ
	|ГДЕ
	|	ПереоценкаТоваровАТТ.ВедущаяЗадача = &ВедущаяЗадача
	|	И ПереоценкаТоваровАТТ.Завершен    = ЛОЖЬ
	|	И ПереоценкаТоваровАТТ.Стартован   = Истина";
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		ОбщегоНазначения.СообщитьОбОшибке(
		НСтр("ru='Существует незавершенный бизнес-процесс:';uk='Існує незавершений бізнес-процес:'") + Выборка.БизнесПроцессПредставление + НСтр("ru=' "
" Задача будет выполнена при завершени бизнес-процесса.';uk='"
"Завдання буде виконано, при завершенні бізнес-процесу.'"), Отказ, Заголовок);

	КонецЦикла;

КонецПроцедуры // ПроверитьВозможностьВыполненияЗадач()

// Функция проверяет существование розничных складов в типами цен документа
//"Установка цен номенклатуры".
// Параметры:
//  МассивСкладов - Произвольный. В данный параметр возвращается 
//					найденные склады.Если складов нет, то возвращается пустой масив.
//  Заголовок - строка, заголовок сообщения об ошибке.
//
Функция ПроверитьНаличиеРозничныхСкладовПоТипамЦенДокумента(МассивСкладов = Неопределено, Заголовок = "")

	МассивСкладов = ПолучитьРозничныеСкладыПоТипамЦенДокумента(УстановкаЦенНоменклатуры);
	Результат = (Не МассивСкладов.Количество() = 0);
	Возврат Результат;

КонецФункции //ПроверитьНаличиеРозничныхСкладовПоТипамЦенДокумента()

// Процедура проверяет наличие незваершенных бизнес-процессов по документу "УстановкаЦенНоменклатуры"".
//
// Параметры:
//  ДокументУстановкаЦенНоменклатуры - ДокументСсылка.УстановкаЦенНоменклатуры.
//  Отказ - булево, флаг отказа.
//  Заголовок - строка, заголовок сообщения об ошибке.
//
Процедура ПровертьНаличиеАктивныхБизнесПроцессовПереоценки(ДокументУстановкаЦенНоменклатуры,
															Отказ,
															Заголовок)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПереоценкаТоваровРозница.Ссылка) Как БизнесПроцесс
	|ИЗ
	|	БизнесПроцесс.ПереоценкаТоваровРозница КАК ПереоценкаТоваровРозница
	|ГДЕ
	|	ПереоценкаТоваровРозница.УстановкаЦенНоменклатуры = &УстановкаЦенНоменклатуры
	|	И ПереоценкаТоваровРозница.Завершен = ЛОЖЬ
	|	И ПереоценкаТоваровРозница.Ссылка <> &Ссылка
	|	И ПереоценкаТоваровРозница.Стартован = ИСТИНА");

	Запрос.УстановитьПараметр("УстановкаЦенНоменклатуры", ДокументУстановкаЦенНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка",                   Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		ОбщегоНазначения.СообщитьОбОшибке(
		НСтр("ru='По документу ""';uk='По документу ""'") + УстановкаЦенНоменклатуры + НСтр("ru='"" существует незавершенный бизнес-процесс"
"';uk='"" існує незавершений бізнес-процес"
"'") + Выборка.БизнесПроцесс + НСтр("ru='"
"Выполнение бизнес-процесса не требуется.';uk='"
"Виконання бізнес-процесу не потрібно.'"), Отказ, Заголовок);

	КонецЕсли;

КонецПроцедуры // ПровертьНаличиеАктивныхБизнесПроцессовПереоценки()

// Процедура проверяет возможность старта бизнес-процесса.
//
// Параметры:
//  Отказ - булево, отказ от старта.
//  Заголовок - строка, заголовок сообщения об ошибке.
//
Процедура ПроверитьВозможностьСтарта(Отказ, Заголовок)

	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Настройка");
	СтруктураПолей.Вставить("УстановкаЦенНоменклатуры");

	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,
															СтруктураПолей,
															Отказ,
															Заголовок);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Отказ = Не ПроверитьНаличиеРозничныхСкладовПоТипамЦенДокумента( ,Заголовок);
	Если Отказ Тогда

		ОбщегоНазначения.СообщитьОбОшибке(
		НСтр("ru='Не удалось определить ни одного розничного склада для переоценки по выбранным документе типам цен."
"Выполнение бизнес-процесса не требуется.';uk='Не вдалося визначити жодного роздрібного складу для переоцінки за обраним у документі типам цін."
"Виконання бізнес-процесу не потрібно.'"),, Заголовок);
		Возврат;
	КонецЕсли;

	ПровертьНаличиеАктивныхБизнесПроцессовПереоценки(УстановкаЦенНоменклатуры,
													 Отказ,
													 Заголовок);

КонецПроцедуры // ПроверитьВозможностьСтарта()

// Функция формирует массив розничных складов по указанным в документе типам цен.
//
// Параметры:
//  УстановкаЦенНоменклатуры - документ "УстановкаЦенНоменклатуры".
// Возвращаемое значение:
//  Массив складов
//
Функция ПолучитьРозничныеСкладыПоТипамЦенДокумента(УстановкаЦенНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УстановкаЦенНоменклатуры", УстановкаЦенНоменклатуры);
	Запрос.УстановитьПараметр("ВидСкладаРозничный",       Перечисления.ВидыСкладов.Розничный);
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК ТипыЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО ТипыЦен.ТипЦен = Склады.ТипЦенРозничнойТорговли
	|ГДЕ
	|	ТипыЦен.Ссылка = &УстановкаЦенНоменклатуры
	|	И Склады.ВидСклада = &ВидСкладаРозничный
	|	И Склады.ПометкаУдаления = Ложь";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");

КонецФункции // ПолучитьРозничныеСкладыПоТипамЦенДокумента()

// Функция возвращает настройку для вложенного бизнес-процесса.
//
// Параметры:
//  ТочкаМаршрута - ТочкаМаршрутаБизнесПроцесса.
//  Настройка     - СправочникСсылка.НастройкиБизнесПроцессов, настройка, из 
//					которой нужно получить параметры.
//
Функция ПолучитьНастройкуБизнесПроцесса(ТочкаМаршрута, Настройка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("Настройка",     Настройка);
	Запрос .Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Параметры.Настройка КАК Настройка,
	|	Параметры.Выполнять КАК Выполнять
	|ИЗ
	|	Справочник.НастройкиБизнесПроцессов.ПараметрыТочекМаршрута КАК Параметры
	|ГДЕ
	|	Параметры.Ссылка = &Настройка
	|	И Параметры.ТочкаМаршрута = &ТочкаМаршрута";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Настройка;
	Иначе
		Возврат Справочники.НастройкиБизнесПроцессов.ПустаяСсылка();
	КонецЕсли;

КонецФункции // ПолучитьНастройкуБизнесПроцесса

// Процедура формирует массив задач для точки маршрута.
//
//Параметры:
//  ТочкаМаршрутаБизнесПроцесса - ТочкаМаршрутаБизнесПроцесса.
//  ФормируемыеЗадачи           - пустой массив для задач.
//  СтандартнаяОбработка        - булево,флаг выполнения стандартной обработки.
//
Процедура СформироватьЗадачиТочкиМаршрута(ТочкаМаршрутаБизнесПроцесса,
										  ФормируемыеЗадачи, 
										  СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ВыборкаПараметры = РаботаСБизнесПроцессами.ПолучитьПараметрыТочкиМаршрута(
							Настройка,
							ТочкаМаршрутаБизнесПроцесса);

	Если Не ВыборкаПараметры.Следующий() Тогда
		Возврат;
	КонецЕсли;

	Если Не ВыборкаПараметры.Выполнять Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗадач = РаботаСБизнесПроцессами.СформироватьПараметрыШапкиЗадач(ВыборкаПараметры);
	ПараметрыЗадач.Вставить("ТочкаМаршрута", ТочкаМаршрутаБизнесПроцесса);
	ПараметрыЗадач.Вставить("Исполнитель",   Инициатор);
	ПараметрыЗадач.Вставить("БизнесПроцесс", Ссылка);

	ФормируемыеЗадачи.Добавить(РаботаСБизнесПроцессами.УстановитьПараметрыЗадачи(ПараметрыЗадач));

КонецПроцедуры // СформироватьЗадачиТочкиМаршрута()

// Процедура формирует бизнес-процессы "ПереоценкаТоваровАТТ" для складов.
//
//  Параметры:
//  ТочкаМаршрута- ТочкаМаршрутаБизнесПроцесса.
//  ФормируемыеБизнесПроцессы - массив, элементами которого являются бизнес процессы.
//  Отказ - булево, флаг отказа от создания бизнес-процессов.
//
Процедура СформироватьБизнесПроцессыПереоценкаАТТ(ТочкаМаршрута,ФормируемыеБизнесПроцессы, Отказ)
	Перем МассивСкладов;

	Отказ = Не ПроверитьНаличиеРозничныхСкладовПоТипамЦенДокумента(МассивСкладов);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	НастройкаВложенногоПроцесса = ПолучитьНастройкуБизнесПроцесса(ТочкаМаршрута, Настройка);
	ТекДата = ТекущаяДата();
	Для Каждого ТекСклад Из МассивСкладов Цикл

		БизнесПроцесс = БизнесПроцессы.ПереоценкаТоваровАТТ.СоздатьБизнесПроцесс();
		БизнесПроцесс.Дата                     = ТекДата;
		БизнесПроцесс.Склад                    = ТекСклад;
		БизнесПроцесс.УстановкаЦенНоменклатуры = УстановкаЦенНоменклатуры;
		БизнесПроцесс.Настройка                = НастройкаВложенногоПроцесса;
		БизнесПроцесс.Инициатор                = Инициатор;
		ФормируемыеБизнесПроцессы.Добавить(БизнесПроцесс);

	КонецЦикла;

КонецПроцедуры // СформироватьБизнесПроцессыПереоценкаАТТ()

// Процедура вызывается перед стартом бизнес-процесса для выполнения проверок и
//заполнения реквизитов.
//
// Параметры:
//  Отказ - булево, флаг отказа.
//
Процедура ПередСтартомБизнесПроцесса(Отказ)

	ПроверитьВозможностьСтарта(Отказ, НСтр("ru='Старт бизнес-процесса: ';uk='Старт бізнес-процесу: '") + Ссылка);

	Если Не Отказ Тогда
		ОбработатьСтартБизнесПроцесса();
	КонецЕсли;

КонецПроцедуры // ПередСтартомБизнесПроцесса()

// Процедура вызывается перед стартом бизнес-процесса для заполнения реквизитов.
//
Процедура ОбработатьСтартБизнесПроцесса()

	Если Инициатор.Пустая() Тогда
		Инициатор = ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;

	ДатаСтарта = ТекущаяДата();

КонецПроцедуры // ОбработатьСтартБизнесПроцесса()

// Процедура устанавливает реквизиты бизнес-процесса перед завершением.
//
Процедура ОбработатьЗавершениеБизнесПроцесса()

	ДатаЗавершения = ТекущаяДата();

КонецПроцедуры // ОбработатьЗавершениеБизнесПроцесса()

// Процедура вызывается при создании задач переоценки склада АТТ.
//
// Параметры:
//  ТочкаМаршрута     - ТочкамаршрутаБизнесПроцесса.
//  ФормируемыеЗадачи - массив задач.
//  Отказ - булево, флаг отказа от создания задач.
//
Процедура ПриСозданииЗадачПереоценкаСкладаАТТ(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)

	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВыборкаПараметры = РаботаСБизнесПроцессами.ПолучитьПараметрыТочкиМаршрута(
						Настройка,
						ТочкаМаршрута);

	Если Не ВыборкаПараметры.Следующий() Тогда
		Возврат;
	КонецЕсли;

	Если Не ВыборкаПараметры.Выполнять Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗадач = РаботаСБизнесПроцессами.СформироватьПараметрыШапкиЗадач(ВыборкаПараметры);
	ПараметрыЗадач.Вставить("ТочкаМаршрута", ТочкаМаршрута);
	ПараметрыЗадач.Вставить("БизнесПроцесс", Ссылка);

	Для Каждого ЗадачаПользователя Из ФормируемыеЗадачи Цикл

		РаботаСБизнесПроцессами.УстановитьПараметрыЗадачи(ПараметрыЗадач, ЗадачаПользователя);

	КонецЦикла;
	
КонецПроцедуры // ПриСозданииЗадачПереоценкаСкладаАТТ()

////////////////////////////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ ТОЧЕК МАРШРУТА
//

// Процедура - обработчик события ПриЗавершении точки маршрута ПереоценкаОсуществлена.
//
Процедура ПереоценкаОсуществленаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)

	ОбработатьЗавершениеБизнесПроцесса();

КонецПроцедуры // ПереоценкаОсуществленаПриЗавершении()

// Процедура - обработчик события ПередСтартом точки маршрута ПередСтартом.
//
Процедура НачатьПереоценкуПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)

	ПередСтартомБизнесПроцесса(Отказ)

КонецПроцедуры // НачатьПереоценкуПередСтартом()

// Процедура - обработчик события ПриСозданииЗадач точки маршрута "ПереоценкаСкладаАТТ".
//
Процедура ПереоценкаСкладаАТТПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса,
											  ФормируемыеЗадачи,
											  Отказ)

	ПриСозданииЗадачПереоценкаСкладаАТТ(ТочкаМаршрутаБизнесПроцесса,
										ФормируемыеЗадачи, 
										Отказ);

КонецПроцедуры // ПереоценкаСкладаАТТПриСозданииЗадач()

// Процедура - обработчик события ПередСозданиемВложенныхБизнесПроцессов точки
//маршрута "ПереоценкаСкладаАТТ".
//
Процедура ПереоценкаСкладаАТТПередСозданиемВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса,
																	ФормируемыеБизнесПроцессы,
																	Отказ)

	СформироватьБизнесПроцессыПереоценкаАТТ(ТочкаМаршрутаБизнесПроцесса,
											ФормируемыеБизнесПроцессы,
											Отказ);

КонецПроцедуры // ПереоценкаСкладаАТТПередСозданиемВложенныхБизнесПроцессов()

// Процедура - обработчик события "ПередВыполнением" точки маршрута "ПереоценкаСкладаАТТ".
//
Процедура ПереоценкаСкладаАТТПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	ПроверитьВозможностьВыполненияЗадач(Задача, Отказ);

КонецПроцедуры // ПереоценкаСкладаАТТПередВыполнением()

// Процедура - обработчик события "ПередСозданиемЗадач" точки маршрута "ПроконтролироватьПереоценку".
//
Процедура ПроконтролироватьПереоценкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса,
														 ФормируемыеЗадачи, 
														 СтандартнаяОбработка)

	СформироватьЗадачиТочкиМаршрута(ТочкаМаршрутаБизнесПроцесса,
									ФормируемыеЗадачи,
									СтандартнаяОбработка);

КонецПроцедуры // ПроконтролироватьПереоценкуПередСозданиемЗадач()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА
//

// Процедура - обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	УстановкаЦенНоменклатуры = Документы.УстановкаЦенНоменклатуры.ПустаяСсылка();
	ЗавершенПринудительно = Ложь;
	ДатаЗавершения = Дата(1,1,1);
	ДатаСтарта     = Дата(1,1,1);

КонецПроцедуры // ПриКопировании()

// Процедура - обработчик события ОбработкаЗаполнения
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
		УстановкаЦенНоменклатуры = Основание.Ссылка;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()
